In [7]:
data = [85, 62, 91, 78, 55, 99, 73, 48, 88, 67]
print(data * 2)

[85, 62, 91, 78, 55, 99, 73, 48, 88, 67, 85, 62, 91, 78, 55, 99, 73, 48, 88, 67]

In [8]:
import numpy as np

grade = np.array(data)
print(grade)
print(grade * 2)

[85 62 91 78 55 99 73 48 88 67]
[170 124 182 156 110 198 146  96 176 134]

In [9]:
Students = np.array([["Emma", "Noah", "Olivia", "Liam", "Ava", "Mason", "Sophia", "Jacob", "Isabella", "William"] ,grade, [2.5, 6.0, 1.0, 4.5, 8.0, 3.0, 7.5, 5.0, 0.5, 9.0]])

print(Students)

[['Emma' 'Noah' 'Olivia' 'Liam' 'Ava' 'Mason' 'Sophia' 'Jacob' 'Isabella'
  'William']
 ['85' '62' '91' '78' '55' '99' '73' '48' '88' '67']
 ['2.5' '6.0' '1.0' '4.5' '8.0' '3.0' '7.5' '5.0' '0.5' '9.0']]

In [10]:
print(Students[0])

['Emma' 'Noah' 'Olivia' 'Liam' 'Ava' 'Mason' 'Sophia' 'Jacob' 'Isabella'
 'William']

In [11]:
Students.shape

(3, 10)

In [12]:
Students.dtype

dtype('<U32')

In [13]:
Students.size

30

In [14]:
import pandas as pd

In [15]:
df = pd.DataFrame(Students.T, columns= ['Name', 'Grade', 'Study Hours'])
print(df)

       Name Grade Study Hours
0      Emma    85         2.5
1      Noah    62         6.0
2    Olivia    91         1.0
3      Liam    78         4.5
4       Ava    55         8.0
5     Mason    99         3.0
6    Sophia    73         7.5
7     Jacob    48         5.0
8  Isabella    88         0.5
9   William    67         9.0

In [18]:
df['Grade'] = pd.to_numeric(df['Grade'])
df['Study Hours'] = pd.to_numeric(df['Study Hours'])

In [20]:
df.head()

     Name  Grade  Study Hours
0    Emma     85          2.5
1    Noah     62          6.0
2  Olivia     91          1.0
3    Liam     78          4.5
4     Ava     55          8.0

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         10 non-null     object
 1   Grade        10 non-null     int64
 2   Study Hours  10 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 372.0+ bytes

In [22]:
df.describe()

           Grade  Study Hours
count  10.000000    10.000000
mean   74.600000     4.700000
std    16.581114     2.945807
min    48.000000     0.500000
25%    63.250000     2.625000
50%    75.500000     4.750000
75%    87.250000     7.125000
max    99.000000     9.000000

In [23]:
print(df['Name'])

0        Emma
1        Noah
2      Olivia
3        Liam
4         Ava
5       Mason
6      Sophia
7       Jacob
8    Isabella
9     William
Name: Name, dtype: object

In [25]:
print(df[['Name', 'Grade']])

       Name  Grade
0      Emma     85
1      Noah     62
2    Olivia     91
3      Liam     78
4       Ava     55
5     Mason     99
6    Sophia     73
7     Jacob     48
8  Isabella     88
9   William     67